pirsasha/esp32-midea-ac/sdkconfig.defaults
# Включаем стек Zigbee и задаём роль устройства (ROUTER — mains-powered)
CONFIG_ESP_ZB_ENABLE=y
CONFIG_ESP_ZB_DEVICE_TYPE_ZED=n
CONFIG_ESP_ZB_DEVICE_TYPE_ZR=y
CONFIG_ESP_ZB_DEVICE_TYPE_ZC=n
CONFIG_ESP_ZB_RADIO_USE_NATIVE=y
CONFIG_ESP_ZB_RADIO_UART=n
CONFIG_ESP_ZB_FLASH_NVRAM_ENABLED=y
# Роутер всегда онлайн — сон и tickless-idle выключены
CONFIG_PM_ENABLE=n
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n
CONFIG_FREERTOS_HZ=1000
CONFIG_IEEE802154_SLEEP_ENABLE=n
CONFIG_IDF_TARGET="esp32h2"
# Правильные имена Kconfig для Zigbee (esp-zigbee-lib): роль Router (ZCZR)
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZED=n
CONFIG_ZB_ZCZR=y
CONFIG_ZB_RADIO_NATIVE=y
# Оптимизация по размеру — прошивка с OTA-клиентом впритык к разделу (2MB flash)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
